cf_billing/InformationRegisters/бестПриоритетПередачиПоказанийНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестПриоритетПередачиПоказанийНП</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособПередачиПоказаний</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникПоказаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестПриоритетПередачиПоказанийНП/Forms/ФормаУстановкаПриоритетов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Модифицированность Тогда
	
		Отказ = Истина;
	    ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаОтветаНаВопрос", ЭтотОбъект), "Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьПриоритетыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	ЗаполнитьПриоритетыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриоритетыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриоритетыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриоритетыПриоритетПриИзменении(Элемент)
	Приоритеты.Сортировать("Приоритет Убыв");
	Модифицированность = Истина;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКоманд
&НаКлиенте
Процедура ЗаполнитьПриоритеты(Команда)
	ЗаполнитьПриоритетыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьНаСервере();
	Закрыть();
КонецПроцедуры
#КонецОбласти

#Область Дополнительныепроцедуры
&НаСервере
Процедура ЗаполнитьПриоритетыНаСервере()
	Приоритеты.Очистить();
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(бестПриоритетПередачиПоказанийНПСрезПоследних.Приоритет, 0) КАК Приоритет,
		|	энргИсточникиПоказаний.Ссылка КАК ИсточникПоказаний
		|ИЗ
		|	Справочник.энргИсточникиПоказаний КАК энргИсточникиПоказаний
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПриоритетПередачиПоказанийНП.СрезПоследних(
		|				&Дата,
		|				Организация = &Организация
		|					И Район = &Район) КАК бестПриоритетПередачиПоказанийНПСрезПоследних
		|		ПО энргИсточникиПоказаний.Ссылка = бестПриоритетПередачиПоказанийНПСрезПоследних.ИсточникПоказаний
		|ГДЕ
		|	НЕ энргИсточникиПоказаний.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТЗ = Приоритеты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ, Выборка);
	КонецЦикла;
	
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	Если Не ЗначениеЗаполнено(Дата) Или Не ЗначениеЗаполнено(Организация) Или Приоритеты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборРС = РегистрыСведений.бестПриоритетПередачиПоказанийНП.СоздатьНаборЗаписей();
	НаборРС.Отбор.Период.Установить(Дата);
	НаборРС.Отбор.Организация.Установить(Организация);
	НаборРС.Отбор.Район.Установить(Район);
	
	Для каждого СтрокаТЗ Из Приоритеты Цикл
		ЗаписьРС = НаборРС.Добавить();
		ЗаписьРС.Период				= Дата;
		ЗаписьРС.Организация		= Организация;
		ЗаписьРС.Район				= Район;
		ЗаписьРС.ИсточникПоказаний	= СтрокаТЗ.ИсточникПоказаний;
		ЗаписьРС.Приоритет			= СтрокаТЗ.Приоритет;
	КонецЦикла;
	
	Попытка
		НаборРС.Записать(Истина);
		Модифицированность = Ложь;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить приоритеты по причине: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаНаВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаписатьНаСервере();
		Закрыть();
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
